# Программа принимает действительное положительное число x и целое отрицательное число y.
# Выполните возведение числа x в степень y. Задание реализуйте в виде функции my_func(x, y).
# При решении задания нужно обойтись без встроенной функции возведения числа в степень.

#   Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

def my_func(x,y):
    a=1
    for i in range(abs(y)):
        a=a*1/x
    print(a)

x = float(input("enter a positive num: "))
y = int(input("enter a negative num: "))

my_func(x,y)